In [40]:
import pandas as pd
from pathlib import Path

In [41]:
inputfilepath = Path(r"C:\Users\jasonjia\Dropbox\Projects\denmark_spending\data\spending_matrix_full_long.csv")
outputfilepath = Path(r"C:\Users\jasonjia\Dropbox\Projects\denmark_spending\data\spending_matrix_full_long_processed.csv")
region_namespath = Path(r"C:\Users\jasonjia\Dropbox\Projects\denmark_spending\data\dk_municipalities_code_to_name.xlsx")
sector_namespath = Path(r"C:\Users\jasonjia\Dropbox\Projects\denmark_spending\data\sector_number_to_name.xlsx")

In [42]:
# Part 1: Do preliminary processing (mainly change names, reorder columns)

In [43]:
df = pd.read_csv(inputfilepath, low_memory=False)

In [44]:
df.shape

(3841992, 5)

In [45]:
df.head()

  cust_muni spend_muni cust_sector spend_sector  amount_dkk
0       101        101         s01          s01  50520576.0
1       101        101         s01          s02   8743208.0
2       101        101         s01          s03  64380656.0
3       101        101         s01          s04  24944372.0
4       101        101         s01          s05  15440209.0

In [46]:
df.columns

Index(['cust_muni', 'spend_muni', 'cust_sector', 'spend_sector', 'amount_dkk'], dtype='object')

In [47]:
df.rename(columns = {'cust_muni':'spender_region', 
                     'spend_muni':'recipient_region',
                     'cust_sector':'spender_sector',
                     'spend_sector':'recipient_sector',
                     'amount_dkk':'spend'}, inplace = True)

In [48]:
df.head()

  spender_region recipient_region spender_sector recipient_sector       spend
0            101              101            s01              s01  50520576.0
1            101              101            s01              s02   8743208.0
2            101              101            s01              s03  64380656.0
3            101              101            s01              s04  24944372.0
4            101              101            s01              s05  15440209.0

In [49]:
df['spender_sector'] = df['spender_sector'].str.replace('s','')
df['recipient_sector'] = df['recipient_sector'].str.replace('s','')
df

,spender_region,recipient_region,spender_sector,recipient_sector,spend
0,101,101,01,01,50520576.0
1,101,101,01,02,8743208.0
2,101,101,01,03,64380656.0
3,101,101,01,04,24944372.0
4,101,101,01,05,15440209.0
...,...,...,...,...,...
3841987,foreign,foreign,28,10,NaN
3841988,foreign,foreign,28,11,NaN
3841989,foreign,foreign,28,12,NaN
3841990,foreign,foreign,28,17,NaN
3841991,foreign,foreign,28,18,NaN

In [50]:
df = df.reindex(columns=['spender_region', 'spender_sector', 'recipient_region', 'recipient_sector',
                                 'spend'])
df

,spender_region,spender_sector,recipient_region,recipient_sector,spend
0,101,01,101,01,50520576.0
1,101,01,101,02,8743208.0
2,101,01,101,03,64380656.0
3,101,01,101,04,24944372.0
4,101,01,101,05,15440209.0
...,...,...,...,...,...
3841987,foreign,28,foreign,10,NaN
3841988,foreign,28,foreign,11,NaN
3841989,foreign,28,foreign,12,NaN
3841990,foreign,28,foreign,17,NaN
3841991,foreign,28,foreign,18,NaN

In [51]:
# Part 2: Convert region codes into actual region names

In [52]:
region_names = pd.read_excel(region_namespath)

In [53]:
region_names.shape

(100, 2)

In [54]:
region_names.head()

  Code           Name
0  101      København
1  147  Frederiksberg
2  151       Ballerup
3  153        Brøndby
4  155         Dragør

In [55]:
# region_names = region_names.append({'Code': 'foreign', 'Name': 'Foreign'}, ignore_index=True) # Already done so in the Excel sheet

In [56]:
region_names

       Code           Name
0       101      København
1       147  Frederiksberg
2       151       Ballerup
3       153        Brøndby
4       155         Dragør
..      ...            ...
95      846  Mariagerfjord
96      849     Jammerbugt
97      851        Aalborg
98      860       Hjørring
99  foreign        Foreign

[100 rows x 2 columns]

In [57]:
# Because region codes contain numbers (e.g. 101) and strings (i.e. 'foreign'), 
# we need to convert them both to the same data type.
region_names['Code'].dtype

dtype('O')

In [58]:
region_names['Code'] = region_names['Code'].astype('str')
region_names['Code'].dtype

dtype('O')

In [59]:
df['spender_region'] = df['spender_region'].astype('str')
df['spender_region'].dtype

dtype('O')

In [60]:
df_names = df.merge(region_names, left_on='spender_region', right_on='Code', how='left')
df_names

,spender_region,spender_sector,recipient_region,recipient_sector,spend,Code,Name
0,101,01,101,01,50520576.0,101,København
1,101,01,101,02,8743208.0,101,København
2,101,01,101,03,64380656.0,101,København
3,101,01,101,04,24944372.0,101,København
4,101,01,101,05,15440209.0,101,København
...,...,...,...,...,...,...,...
3841987,foreign,28,foreign,10,NaN,foreign,Foreign
3841988,foreign,28,foreign,11,NaN,foreign,Foreign
3841989,foreign,28,foreign,12,NaN,foreign,Foreign
3841990,foreign,28,foreign,17,NaN,foreign,Foreign
3841991,foreign,28,foreign,18,NaN,foreign,Foreign

In [61]:
df_names = df_names.rename(columns = {'Name':'spender_region_name'})
df_names = df_names.drop(['Code'], axis = 1)
df_names

,spender_region,spender_sector,recipient_region,recipient_sector,spend,spender_region_name
0,101,01,101,01,50520576.0,København
1,101,01,101,02,8743208.0,København
2,101,01,101,03,64380656.0,København
3,101,01,101,04,24944372.0,København
4,101,01,101,05,15440209.0,København
...,...,...,...,...,...,...
3841987,foreign,28,foreign,10,NaN,Foreign
3841988,foreign,28,foreign,11,NaN,Foreign
3841989,foreign,28,foreign,12,NaN,Foreign
3841990,foreign,28,foreign,17,NaN,Foreign
3841991,foreign,28,foreign,18,NaN,Foreign

In [62]:
df_names = df_names.merge(region_names, left_on='recipient_region', right_on='Code', how='left')
df_names

,spender_region,spender_sector,recipient_region,recipient_sector,spend,spender_region_name,Code,Name
0,101,01,101,01,50520576.0,København,101,København
1,101,01,101,02,8743208.0,København,101,København
2,101,01,101,03,64380656.0,København,101,København
3,101,01,101,04,24944372.0,København,101,København
4,101,01,101,05,15440209.0,København,101,København
...,...,...,...,...,...,...,...,...
3841987,foreign,28,foreign,10,NaN,Foreign,foreign,Foreign
3841988,foreign,28,foreign,11,NaN,Foreign,foreign,Foreign
3841989,foreign,28,foreign,12,NaN,Foreign,foreign,Foreign
3841990,foreign,28,foreign,17,NaN,Foreign,foreign,Foreign
3841991,foreign,28,foreign,18,NaN,Foreign,foreign,Foreign

In [63]:
df_names = df_names.rename(columns = {'Name':'recipient_region_name'})
df_names = df_names.drop(['Code'], axis = 1)
df_names

,spender_region,spender_sector,recipient_region,recipient_sector,spend,spender_region_name,recipient_region_name
0,101,01,101,01,50520576.0,København,København
1,101,01,101,02,8743208.0,København,København
2,101,01,101,03,64380656.0,København,København
3,101,01,101,04,24944372.0,København,København
4,101,01,101,05,15440209.0,København,København
...,...,...,...,...,...,...,...
3841987,foreign,28,foreign,10,NaN,Foreign,Foreign
3841988,foreign,28,foreign,11,NaN,Foreign,Foreign
3841989,foreign,28,foreign,12,NaN,Foreign,Foreign
3841990,foreign,28,foreign,17,NaN,Foreign,Foreign
3841991,foreign,28,foreign,18,NaN,Foreign,Foreign

In [64]:
# Test
df_names[(df_names['recipient_sector']=='10') & (df_names['recipient_region']=='846') & (df_names['spender_sector']=='20')] # Test

,spender_region,spender_sector,recipient_region,recipient_sector,spend,spender_region_name,recipient_region_name
27659,101,20,846,10,13.365163,København,Mariagerfjord
66467,147,20,846,10,NaN,Frederiksberg,Mariagerfjord
105275,151,20,846,10,1.237310,Ballerup,Mariagerfjord
144083,153,20,846,10,NaN,Brøndby,Mariagerfjord
182891,155,20,846,10,3.072191,Dragør,Mariagerfjord
...,...,...,...,...,...,...,...
3675611,846,20,846,10,22096.078000,Mariagerfjord,Mariagerfjord
3714419,849,20,846,10,NaN,Jammerbugt,Mariagerfjord
3753227,851,20,846,10,149.292800,Aalborg,Mariagerfjord
3792035,860,20,846,10,NaN,Hjørring,Mariagerfjord
3830843,foreign,20,846,10,NaN,Foreign,Mariagerfjord

## Skip Part 3 because it creates a lot of lag (filtering through strings vs numbers) -> jump straight to Part 4

In [26]:
# Part 3: Convert sector numbers into actual sector names 
# (But for historical reasons, we drop the original sector numbers, and rename sector_name -> sector)
# (So that no adjustments need to be made on Tableau other than updating the data source)

# Tried but this caused huge lags - trying not to use it for now

In [27]:
sector_names = pd.read_excel(sector_namespath)
sector_names.shape

(28, 2)

In [28]:
sector_names.head()

   sector_number                                   sector_name
0              1                       1 - Food away from home
1              2                             2 - Entertainment
2              3                                 3 - Groceries
3              4             4 - Personal services, pharmacies
4              5  5 - Cars, fuel, car repair, public transport

In [29]:
# Because sector codes are numbers, but may be viewed as numbers (int64) or strings,
# we need to convert them to the same data type

In [30]:
sector_names['sector_number'].dtype

dtype('int64')

In [31]:
print(df_names['spender_sector'].dtype)
df_names['spender_sector'] = df_names['spender_sector'].astype('int64')
print(df_names['spender_sector'].dtype)

object
int64

In [32]:
print(df_names['recipient_sector'].dtype)
df_names['recipient_sector'] = df_names['recipient_sector'].astype('int64')
print(df_names['recipient_sector'].dtype)

object
int64

In [33]:
# Merge spender sector
df_names = df_names.merge(sector_names, left_on='spender_sector', right_on='sector_number', how='left')
df_names

,spender_region,spender_sector,recipient_region,recipient_sector,spend,spender_region_name,recipient_region_name,sector_number,sector_name
0,101,1,101,1,50520576.0,København,København,1,1 - Food away from home
1,101,1,101,2,8743208.0,København,København,1,1 - Food away from home
2,101,1,101,3,64380656.0,København,København,1,1 - Food away from home
3,101,1,101,4,24944372.0,København,København,1,1 - Food away from home
4,101,1,101,5,15440209.0,København,København,1,1 - Food away from home
...,...,...,...,...,...,...,...,...,...
3841987,foreign,28,foreign,10,NaN,Foreign,Foreign,28,28 - Unemployed
3841988,foreign,28,foreign,11,NaN,Foreign,Foreign,28,28 - Unemployed
3841989,foreign,28,foreign,12,NaN,Foreign,Foreign,28,28 - Unemployed
3841990,foreign,28,foreign,17,NaN,Foreign,Foreign,28,28 - Unemployed
3841991,foreign,28,foreign,18,NaN,Foreign,Foreign,28,28 - Unemployed

In [34]:
df_names = df_names.drop(['sector_number', 'spender_sector'], axis = 1)
df_names = df_names.rename(columns = {'sector_name':'spender_sector'})
df_names

,spender_region,recipient_region,recipient_sector,spend,spender_region_name,recipient_region_name,spender_sector
0,101,101,1,50520576.0,København,København,1 - Food away from home
1,101,101,2,8743208.0,København,København,1 - Food away from home
2,101,101,3,64380656.0,København,København,1 - Food away from home
3,101,101,4,24944372.0,København,København,1 - Food away from home
4,101,101,5,15440209.0,København,København,1 - Food away from home
...,...,...,...,...,...,...,...
3841987,foreign,foreign,10,NaN,Foreign,Foreign,28 - Unemployed
3841988,foreign,foreign,11,NaN,Foreign,Foreign,28 - Unemployed
3841989,foreign,foreign,12,NaN,Foreign,Foreign,28 - Unemployed
3841990,foreign,foreign,17,NaN,Foreign,Foreign,28 - Unemployed
3841991,foreign,foreign,18,NaN,Foreign,Foreign,28 - Unemployed

In [35]:
# Merge recipient sector
df_names = df_names.merge(sector_names, left_on='recipient_sector', right_on='sector_number', how='left')
df_names

,spender_region,recipient_region,recipient_sector,spend,spender_region_name,recipient_region_name,spender_sector,sector_number,sector_name
0,101,101,1,50520576.0,København,København,1 - Food away from home,1,1 - Food away from home
1,101,101,2,8743208.0,København,København,1 - Food away from home,2,2 - Entertainment
2,101,101,3,64380656.0,København,København,1 - Food away from home,3,3 - Groceries
3,101,101,4,24944372.0,København,København,1 - Food away from home,4,"4 - Personal services, pharmacies"
4,101,101,5,15440209.0,København,København,1 - Food away from home,5,"5 - Cars, fuel, car repair, public transport"
...,...,...,...,...,...,...,...,...,...
3841987,foreign,foreign,10,NaN,Foreign,Foreign,28 - Unemployed,10,10 - Utilities
3841988,foreign,foreign,11,NaN,Foreign,Foreign,28 - Unemployed,11,11 - Specialized retail stores
3841989,foreign,foreign,12,NaN,Foreign,Foreign,28 - Unemployed,12,12 - Home improvement
3841990,foreign,foreign,17,NaN,Foreign,Foreign,28 - Unemployed,17,17 - Finance
3841991,foreign,foreign,18,NaN,Foreign,Foreign,28 - Unemployed,18,18 - Cultural and social organizations

In [36]:
df_names = df_names.drop(['sector_number', 'recipient_sector'], axis = 1)
df_names = df_names.rename(columns = {'sector_name':'recipient_sector'})
df_names

,spender_region,recipient_region,spend,spender_region_name,recipient_region_name,spender_sector,recipient_sector
0,101,101,50520576.0,København,København,1 - Food away from home,1 - Food away from home
1,101,101,8743208.0,København,København,1 - Food away from home,2 - Entertainment
2,101,101,64380656.0,København,København,1 - Food away from home,3 - Groceries
3,101,101,24944372.0,København,København,1 - Food away from home,"4 - Personal services, pharmacies"
4,101,101,15440209.0,København,København,1 - Food away from home,"5 - Cars, fuel, car repair, public transport"
...,...,...,...,...,...,...,...
3841987,foreign,foreign,NaN,Foreign,Foreign,28 - Unemployed,10 - Utilities
3841988,foreign,foreign,NaN,Foreign,Foreign,28 - Unemployed,11 - Specialized retail stores
3841989,foreign,foreign,NaN,Foreign,Foreign,28 - Unemployed,12 - Home improvement
3841990,foreign,foreign,NaN,Foreign,Foreign,28 - Unemployed,17 - Finance
3841991,foreign,foreign,NaN,Foreign,Foreign,28 - Unemployed,18 - Cultural and social organizations

# Part 4: Reindex columns and save output to csv

In [66]:
df_names = df_names.reindex(columns=['spender_region', 'spender_region_name', 'spender_sector', 
                                 'recipient_region', 'recipient_region_name', 'recipient_sector', 'spend'])
df_names

,spender_region,spender_region_name,spender_sector,recipient_region,recipient_region_name,recipient_sector,spend
0,101,København,01,101,København,01,50520576.0
1,101,København,01,101,København,02,8743208.0
2,101,København,01,101,København,03,64380656.0
3,101,København,01,101,København,04,24944372.0
4,101,København,01,101,København,05,15440209.0
...,...,...,...,...,...,...,...
3841987,foreign,Foreign,28,foreign,Foreign,10,NaN
3841988,foreign,Foreign,28,foreign,Foreign,11,NaN
3841989,foreign,Foreign,28,foreign,Foreign,12,NaN
3841990,foreign,Foreign,28,foreign,Foreign,17,NaN
3841991,foreign,Foreign,28,foreign,Foreign,18,NaN

In [67]:
df_names.to_csv(outputfilepath, index=False)